; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-5 - location
	p1-0 - location
	p2-3 - location
	p4-0 - location
	p4-2 - location
	p4-6 - location
	p5-4 - location
	p6-1 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s6)
	(at driver3 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(at package2 s2)
	(at package3 s3)
	(at package4 s6)
	(at package5 s2)
	(at package6 s2)
	(at package7 s1)
	(at package8 s4)
	(at package9 s2)
	(at package10 s2)
	(at package11 s0)
	(at package12 s1)
	(at package13 s1)
	(at package14 s0)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 9)
	(= (time-to-drive s3 s0) 9)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 72)
	(= (time-to-drive s5 s0) 72)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 34)
	(= (time-to-drive s6 s0) 34)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 39)
	(= (time-to-drive s0 s1) 39)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 18)
	(= (time-to-drive s3 s1) 18)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 55)
	(= (time-to-drive s4 s1) 55)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 13)
	(= (time-to-drive s5 s1) 13)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 7)
	(= (time-to-drive s1 s2) 7)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 59)
	(= (time-to-drive s4 s2) 59)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 82)
	(= (time-to-drive s5 s2) 82)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 11)
	(= (time-to-drive s2 s3) 11)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 8)
	(= (time-to-drive s0 s4) 8)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 82)
	(= (time-to-drive s3 s4) 82)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 35)
	(= (time-to-drive s5 s4) 35)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 95)
	(= (time-to-drive s3 s5) 95)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 23)
	(= (time-to-drive s2 s6) 23)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 75)
	(= (time-to-drive s3 s6) 75)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 56)
	(= (time-to-drive s4 s6) 56)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s4)
	(at truck2 s6)
	(at truck3 s1)
	(at package1 s5)
	(at package2 s5)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s1)
	(at package8 s3)
	(at package9 s2)
	(at package10 s4)
	(at package11 s6)
	(at package12 s2)
	(at package13 s5)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s0 p0-5)
   deleted: (at driver1 s0)
   added: (at driver1 p0-5)
   goals met: 1 of 17
2. (walk driver1 p0-5 s5)
   deleted: (at driver1 p0-5)
   added: (at driver1 s5)
   goals met: 1 of 17
3. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 17
4. (walk driver2 s6 p6-2)
   deleted: (at driver2 s6)
   added: (at driver2 p6-2)
   goals met: 1 of 17
5. (drive-truck truck2 s5 s3 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 0 to 950
   goals met: 1 of 17
6. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 17
7. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 950 to 1049
   goals met: 1 of 17
8. (load-truck package11 truck2 s0)
   deleted: (at package11 s0)
   added: (in package11 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 17
9. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 1049 to 1491
   goals met: 2 of 17
10. (unload-truck package11 truck2 s6)
   deleted: (in package11 truck2)
   added: (at package11 s6)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 3 of 17
11. (load-truck package4 truck2 s6)
   deleted: (at package4 s6)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 17
12. (drive-truck truck2 s6 s2 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (fuel-used) from 1491 to 1790
   goals met: 2 of 17
13. (walk driver2 p6-2 s2)
   deleted: (at driver2 p6-2)
   added: (at driver2 s2)
   goals met: 3 of 17
14. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 17
15. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 4 of 17
16. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 17
17. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 4 of 17
18. (load-truck package6 truck2 s2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 4 of 17
19. (load-truck package10 truck2 s2)
   deleted: (at package10 s2)
   added: (in package10 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 4 of 17
20. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 17
21. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 3 of 17
22. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 1790 to 4332
   goals met: 3 of 17
23. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 3 of 17
24. (unload-truck package1 truck2 s5)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 4 of 17
25. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 5 of 17
26. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 17
27. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   goals met: 6 of 17
28. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   goals met: 7 of 17
29. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 17
30. (drive-truck truck2 s5 s4 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 4332 to 5032
   goals met: 6 of 17
31. (unload-truck package10 truck2 s4)
   deleted: (in package10 truck2)
   added: (at package10 s4)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 7 of 17
32. (load-truck package8 truck2 s4)
   deleted: (at package8 s4)
   added: (in package8 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 7 of 17
33. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 5032 to 6672
   goals met: 7 of 17
34. (unload-truck package8 truck2 s3)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 8 of 17
35. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 6672 to 6742
   goals met: 9 of 17
36. (load-truck package12 truck3 s1)
   deleted: (at package12 s1)
   added: (in package12 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 9 of 17
37. (load-truck package13 truck3 s1)
   deleted: (at package13 s1)
   added: (in package13 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 9 of 17
38. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 6742 to 6833
   goals met: 8 of 17
39. (unload-truck package12 truck3 s2)
   deleted: (in package12 truck3)
   added: (at package12 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 9 of 17
40. (drive-truck truck2 s3 s1 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 6833 to 7121
   goals met: 9 of 17
41. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 10 of 17
42. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 11 of 17
43. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 7121 to 7319
   goals met: 11 of 17
44. (drive-truck truck3 s2 s5 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 7319 to 8221
   goals met: 11 of 17
45. (unload-truck package13 truck3 s5)
   deleted: (in package13 truck3)
   added: (at package13 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 12 of 17
46. (drive-truck truck3 s5 s2 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 8221 to 9041
   goals met: 12 of 17
47. (drive-truck truck2 s3 s6 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (fuel-used) from 9041 to 9866
   goals met: 13 of 17
48. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 12 of 17
49. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 9866 to 10096
   goals met: 12 of 17
50. (drive-truck truck2 s6 s2 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (fuel-used) from 10096 to 10349
   goals met: 11 of 17
51. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 10349 to 10426
   goals met: 11 of 17
52. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 17
53. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 10426 to 10816
   goals met: 12 of 17
54. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 10816 to 11156
   goals met: 13 of 17
55. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 14 of 17
56. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (fuel-used) from 11156 to 11496
   goals met: 14 of 17
57. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 14 of 17
58. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 14 of 17
59. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 14 of 17
60. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 14 of 17
61. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   goals met: 14 of 17
62. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   goals met: 15 of 17
63. (board-truck driver1 truck2 s6)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 17
64. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 14 of 17
65. (drive-truck truck1 s2 s4 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 11496 to 12086
   goals met: 15 of 17
66. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 12086 to 12426
   goals met: 14 of 17
67. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 14 of 17
68. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 17
69. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 12426 to 12816
   goals met: 15 of 17
70. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 12816 to 12896
   goals met: 14 of 17
71. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 14 of 17
72. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 14 of 17
73. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 17
74. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 12896 to 13286
   goals met: 14 of 17
75. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 14 of 17
76. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 14 of 17
77. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 14 of 17
78. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 13286 to 13676
   goals met: 14 of 17
79. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 14 of 17
80. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 13676 to 13756
   goals met: 15 of 17
81. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 15 of 17
82. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 15 of 17
83. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 15 of 17
84. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   goals met: 15 of 17
85. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   goals met: 16 of 17
86. (walk driver1 s4 p4-0)
   deleted: (at driver1 s4)
   added: (at driver1 p4-0)
   goals met: 16 of 17
87. (walk driver1 p4-0 s0)
   deleted: (at driver1 p4-0)
   added: (at driver1 s0)
   goals met: 16 of 17
88. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 16 of 17
89. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 13756 to 14096
   goals met: 17 of 17
